tutorial/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      http://www.openfoam.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      wavesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

left
{
    alpha           alpha.water;

    waveModel       Boussinesq;

    nPaddle         1;

    waveHeight      0.05;

    waveAngle       0.0;

    activeAbsorption yes;

    tCurrent	    0.0;

    UCurrent	    (0 0 0);

    tWait	    0.0;
}

right
{
    alpha           alpha.water;

    waveModel       shallowWaterAbsorption;

    nPaddle         1;

    tCurrent	    0.0;

    UCurrent	    (0 0 0);

    tWait	    0.0;
}

// ************************************************************************* //

